transferred the arch to use mermaid instead of ascii type visual representation
